{
    "changelog": [
        {
            "versionName": "0.0.1",
            "description": "Welcome to WeStudio, our premier Android code editor inspired by Visual Studio Code. This initial release boasts an array of features designed to enhance your coding experience:\n\n\nFeatures:\n\n- Robust text editing capabilities.\n\n- Comprehensive syntax highlighting for over 50 major programming languages and 300+ file extensions and sub-language variants.\n\n- Essential file management functionalities: create, open, save, and close files.\n\n- Customizable theme options for the editor.\n\n- Integrated search and replace functionality.\n\n- Git repository cloning.\n\n- In-app HTML preview and JavaScript console.\n\n- Remote HTML preview for sharing via hotspot or internet.\n\n- Multi-file support and universal file editor.\n\n- Code formatting and importing of zip projects.\n\n- Singleton window system.\n\n- Breadcrumbs file navigation.\n\n- Access to recently opened projects and creation of projects from templates.\n\n- Extensive code editor customization support, including default save file encoding and font ligatures.\n\n- Integration with Material You design.\n\n- Binary file detection and handling of unsupported file encodings.\n\n- Logging support for enhanced debugging.\n\n- Smart features for improved productivity.\n\n- Implemented automatic crash log collection to gather crash reports seamlessly.\n\n- Utilized crash logs for continuous application improvement, ensuring stability and performance enhancements.\n\n\nKnown Issues:\n\n- File tree manager optimization may be lacking, particularly noticeable on less powerful devices.\n\n- Auto-completion window may not match the editor's theme.\n\n- JavaScript console in the live preview pane may occasionally fail to load.\n\n\nContributors:\n\n  - Main Developer: EUP(https://x.com/etidoUP)\n\n  - Beta Testers:\n\n    • Etido Asanga Henry([Link])\n      • Ike https://github.com/ike10101\n \n\nThank you for choosing WeStudio. We're committed to continually enhancing your coding journey.",
            "releaseDate": 1716961516827,
            "releaseType": "alpha",
            "hasVersionName": true
        }
    ]
}
